# 'brew tap'
# tap "homebrew/cask"
# 'brew tap' with custom Git URL
# tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git"
# 'brew tap' with arguments
# tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git", force_auto_update: true

# set arguments for all 'brew install --cask' commands
# cask_args appdir: "~/Applications", require_sha: true

# 'brew install'
# Official Amazon AWS command-line interface
brew "awscli"
brew "bat"
brew "bat-extras"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Node version manager
brew "fnm"
# Distributed revision control system
brew "git"
brew "thefuck"
# Simplified and community-driven man pages
brew "tlrc"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# 'brew install --with-rmtp', 'brew link --overwrite', 'brew services restart' on version changes
# brew "denji/nginx/nginx-full", link: :overwrite, args: ["with-rmtp"], restart_service: :changed
# 'brew install', always 'brew services restart', 'brew link', 'brew unlink mysql' (if it is installed)
# brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"]
# install only on specified OS
# brew "gnupg" if OS.mac?
# brew "glibc" if OS.linux?

# 'brew install --cask'
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "firefox"
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
cask "insomnia"
# Password manager app
cask "keepassxc"
cask "mysqlworkbench"
# MongoDB management tool
#cask "robo-3t"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
# 'vscode --install-extension'
# vscode "GitHub.codespaces"

